package com.example.articleblog.ui.model

data class ArticleUiModel(
    val articleName: String,
    val articleText: String,
    val eyeValue: String,
    val likeValue: String,
)

object Articles {
    val articleList = listOf<ArticleUiModel>(
        ArticleUiModel(
            articleName = "Ричард великий",
            articleText = "Его брат Ричард, в начале XVI века бежали ко двору императора СвященнойРимской империи, став пешками в международной политике. Существовали также другие родас таким прозванием, но неизвестно, находятся ли они в родстве",
            eyeValue = "115",
            likeValue = "24",
        ),
        ArticleUiModel(
            articleName = "Ричард великий",
            articleText = "Его брат Ричард, в начале XVI века бежали ко двору императора СвященнойРимской империи, став пешками в международной политике. Существовали также другие родас таким прозванием, но неизвестно, находятся ли они в родстве",
            eyeValue = "115",
            likeValue = "24",
        ),
        ArticleUiModel(
            articleName = "Ричард великий",
            articleText = "Его брат Ричард, в начале XVI века бежали ко двору императора СвященнойРимской империи, став пешками в международной политике. Существовали также другие родас таким прозванием, но неизвестно, находятся ли они в родстве",
            eyeValue = "115",
            likeValue = "24",
        ),
        ArticleUiModel(
            articleName = "Ричард великий",
            articleText = "Его брат Ричард, в начале XVI века бежали ко двору императора СвященнойРимской империи, став пешками в международной политике. Существовали также другие родас таким прозванием, но неизвестно, находятся ли они в родстве",
            eyeValue = "115",
            likeValue = "24",
        ),
        ArticleUiModel(
            articleName = "Ричард великий",
            articleText = "Его брат Ричард, в начале XVI века бежали ко двору императора СвященнойРимской империи, став пешками в международной политике. Существовали также другие родас таким прозванием, но неизвестно, находятся ли они в родстве",
            eyeValue = "115",
            likeValue = "24",
        ),
        ArticleUiModel(
            articleName = "Ричард великий",
            articleText = "Его брат Ричард, в начале XVI века бежали ко двору императора СвященнойРимской империи, став пешками в международной политике. Существовали также другие родас таким прозванием, но неизвестно, находятся ли они в родстве",
            eyeValue = "115",
            likeValue = "24",
        ),
    )
}